Revit 2024 API
FamilySizeTable Class
 Contains size information for a family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class FamilySizeTable : IDisposable
Visual Basic
Public Class FamilySizeTable _
	Implements IDisposable
Visual C++
public ref class FamilySizeTable : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTable
See Also
FamilySizeTable Members
Autodesk.Revit.DB Namespace